iPig/src/InformationRegisters/Аборт/Аборт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аборт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаВнесенияДанных/КарточкаВнесенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаВнесенияДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЖивотного</name>
    <type>
      <types>EnumRef.ТипЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/Аборт/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Запись.Период) Тогда
		НаборЗаписей = РегистрыСведений.ЖурналОпороса.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
		НаборЗаписей.Отбор.НомерОпороса.Установить(Запись.НомерОпороса);
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НомерЖивотного") Тогда
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
		Запись.НомерОпороса 	= Параметры.НомерОпороса;
		Запись.ДатаВвода		= Параметры.ДатаВвода;
		Запись.КодПороды 		= Параметры.Порода;
	КонецЕсли;
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаСервере
Процедура НомерЖивотногоПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";
	Запрос.УстановитьПараметр("НомерЖивотного", Запись.НомерЖивотного);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.КодПороды = ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоПриИзменении(Элемент)
	НомерЖивотногоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
#Если Не ВебКлиент Тогда
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
		Если ВыбСтрокаМеню <> Неопределено Тогда
			Реквизиты = ВыбСтрокаМеню.Значение;
			Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
			Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;

#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ДатаАбортаПриИзменении(Элемент)
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	НомерЖивотного = Запись.НомерЖивотного;
	Период = Запись.ДатаВвода;
	Попытка
		ОткрытьФорму("РегистрСведений.КарточкаСвиноматки.Форма.ФормаЗаписи", Новый Структура("Ключ, ФормаОткрыта",
			_НастройкиКонфигурацииНаСервере.ПолучитьКлючЗаписи(НомерЖивотного, Период), Истина), , , , , , );
	Исключение 
		//Сообщить(Строка(Строка.НомерЖивотного)+"_"+ Строка.Период);
	КонецПопытки;
КонецПроцедуры
